---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPatina
source: html/223dfb48-73e5-696b-9f1d-e51ed8d11ce6.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPatina Property

The property labeled "Patina" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPatina { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".